<?php
	include("libAddrParse.php");
	mb_regex_encoding('UTF-8');
	
	// サンプルの住所
	
	//貴族院多額納税者名鑑（大正5）

	$txt = array(
	  	'東京市麹町區三年町五一',
	 	'東京市麹町區永田町二丁目二〇',
		'東京市麹町區紀尾井町四',
		'東京市麹町區富士見町五丁目一',
		'東京市麹町區一番町二',
		'東京市麹町區富士見町六丁目一四',
		'東京市麹町區下二番町七〇',
		'東京市麹町區永田町一ノ一八',
		'東京市麹町區三番町七一',
		'東京市麹町區内幸町一丁目五　幸倶樂部内',
		'東京市麹町區外櫻田町一',
		'東京市麹町區外櫻田町千五'
	);
	
	//新撰東京案内鑑（明治26）
/*
	$txt = array(
		'麹町區飯田町二ノ五七',
	 	'麹町區内山下町',
		'麹町區一番町',
		'麹町四丁目',
		'麹町山元町二丁目',
		'麹町平河町六丁目',
		'麹町隼町',
		'麹町區富士見町一ノ二九',
		'麹町區富士見町千五',
	);
*/
/*	
	$txt=array(
		'東京市麹町区市谷田町１３番地',
		'東京市麹町区市谷田町13',
		'東京市麹町区市谷田町十三番地',
		'東京市麹町区市谷田町十三番',
		'東京市麹町区市谷田町１丁目３番地',
		'東京市麹町区市谷田町一丁目三番地',
		'東京市麹町区市谷田町1-3番地',
		'東京市麹町区市谷田町１ー３',
		'東京市麹町区市谷田町１１１２ー３',
		'東京市麹町区市谷田町１２３０ー３',
		'東京市麹町区市谷田町五〇ー３',
		'東京市麹町区市谷田町百五号',
		'東京市麹町区市谷田町七千五百二丁目八百十三番九百二号',
		'東京市麹町区市谷田町七千五百二丁目八百十三番九百二号',
		'東京市麹町區三年町五一',
		'東京市麹町區永田町二丁目二〇',
		'東京市麹町區紀尾井町四',
		'東京市麹町區富士見町五丁目一',
		'東京市麹町區一番町二',
		'東京市麹町區富士見町六丁目一四',
		'東京市麹町區下二番町七〇',
		'東京市麹町區永田町一ノ一八',
		'東京市麹町區三番町七一',
		'東京市麹町區内幸町一丁目五　幸倶樂部内',
		'東京市麹町區外櫻田町一',
		'麹町區飯田町二ノ五七',
		'麹町區内山下町',
		'麹町區一番町',
		'麹町四丁目',
		'麹町山元町二丁目',
		'麹町平河町六丁目',
		'麹町隼町',
		'麹町區富士見町一ノ二九',
		'麹町區富士見町千八十番',
		'麹町區富士見町百八番',
		'麹町區富士見町千八番',
		'麹町區富士見町千八',
		'麹町區富士見町千八百番'
		);
*/
/*
	$txt=array(
			'東京市麹町区市谷田町一丁目三番4号',
			'東京市麹町区市谷田町三番2号',
			'東京市麹町区市谷田町3丁目三番地',
			'東京市麹町区市谷田町3の2の1',
			'東京市麹町区市谷田町3ノ2ノ1',
			'東京市麹町区市谷田町3丁目2の1'
	);
*/
	foreach($txt as $key=>$value){
		echo "オリジナル：".$value."\n";
		$result = AddrConv($value);
		echo "変換後：".AddrConv($value)."\n";
		echo dpmatching($value, $result, 2, 1)."\n";
		echo "------------\n";
	}

	/*
	// 住所データベースへのアクセス
	try{
		$ad_db = new PDO('sqlite:ad_table.sqlite');
		$sql="SELECT * FROM address_tab WHERE chome !=0";
		foreach($ad_db->query($sql) as $row ){
			$add_txt1=$row['shichoson'].$row['ku'].$row['chomei'];
			$add_txt2=$row['chome']."丁目".$row['banchi']."番".$row['go']."号";
			echo $add_txt1.$add_txt2."\n";
			echo $add_txt1.AddrConv($add_txt2)."\n";
			echo "--------\n";
		}
	}catch (PDOException $e){
		print('Connection failed:'.$e->getMessage());
		die();
	}

	try{
		$db = new PDO('sqlite::memory:');
	}catch (PDOException $e){
		print('Connection failed:'.$e->getMessage());
		die();
	}

	$db=null;
*/


?>